Autodesk.Navisworks.Api.ImageGenerationStyle
Defines the style of the image generation

Autodesk.Navisworks.Api.ImageGenerationStyle.Scene
Render scene

Autodesk.Navisworks.Api.ImageGenerationStyle.SceneUsingRayTrace
Render scene using ray trace

Autodesk.Navisworks.Api.ImageGenerationStyle.ScenePlusOverlay
Render scene plus any overlay such as Redlines